<a href="https://colab.research.google.com/github/stroboskop/data-sience-bootcamp/blob/main/02_analiza_danych/sql_porownanie.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Init

In [ ]:
import numpy as np
import pandas as pd

# Wczytywanie danych

In [ ]:
url = ('https://storage.googleapis.com/esmartdata-courses-files/ds-bootcamp/online_retail.xlsx')
retail_raw = pd.read_excel(url)
retail_raw.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

In [ ]:
retail = retail_raw.copy()
retail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [ ]:
retail.describe().T

               count          mean          std  ...       50%       75%      max
Quantity    541909.0      9.552250   218.081158  ...      3.00     10.00  80995.0
UnitPrice   541909.0      4.611114    96.759853  ...      2.08      4.13  38970.0
CustomerID  406829.0  15287.690570  1713.600303  ...  15152.00  16791.00  18287.0

[3 rows x 8 columns]

In [ ]:
#sprawdzamy braki danych
retail.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [ ]:
#usuwamy braki danych
retail = retail.dropna()

In [ ]:
retail.isnull().sum()

In [ ]:
#usuwanie danych ujemnych
retail = retail[retail.Quantity >= 0]

In [ ]:
#zmiana na typ zmiennej z fload na tekstowy
retail.CustomerID = retail.CustomerID.apply(lambda x: str(int(x)))
retail.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 397924 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    397924 non-null  object
 1   StockCode    397924 non-null  object
 2   Description  397924 non-null  object
 3   Quantity     397924 non-null  int64
 4   InvoiceDate  397924 non-null  datetime64[ns]
 5   UnitPrice    397924 non-null  float64
 6   CustomerID   397924 non-null  object
 7   Country      397924 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 27.3+ MB

# Porównanie z biblioteką pandas

In [ ]:
# SELECT * FROM retail;
retail

In [ ]:
#SELECT Quantity, UnitPrice, CustomerID FROM retail;
retail[['Quantity', 'UnitPrice', 'CustomerID']]

        Quantity  UnitPrice CustomerID
0              6       2.55      17850
1              6       3.39      17850
2              8       2.75      17850
3              6       3.39      17850
4              6       3.39      17850
...          ...        ...        ...
541904        12       0.85      12680
541905         6       2.10      12680
541906         4       4.15      12680
541907         4       4.15      12680
541908         3       4.95      12680

[397924 rows x 3 columns]

In [ ]:
#SELECT Quantity, UnitPrice, CustomerID FROM retail LIMIT 10;
retail[['Quantity', 'UnitPrice', 'CustomerID']].head(10)

   Quantity  UnitPrice CustomerID
0         6       2.55      17850
1         6       3.39      17850
2         8       2.75      17850
3         6       3.39      17850
4         6       3.39      17850
5         2       7.65      17850
6         6       4.25      17850
7         6       1.85      17850
8         6       1.85      17850
9        32       1.69      13047

In [ ]:
# SELECT * FROM retial WHERE CustomerID='17850';
retail[retail.CustomerID == '17850']
retail.query('CustomerID == "17850"')

     InvoiceNo StockCode  ... CustomerID         Country
0       536365    85123A  ...      17850  United Kingdom
1       536365     71053  ...      17850  United Kingdom
2       536365    84406B  ...      17850  United Kingdom
3       536365    84029G  ...      17850  United Kingdom
4       536365    84029E  ...      17850  United Kingdom
...        ...       ...  ...        ...             ...
4540    536790     22752  ...      17850  United Kingdom
4541    536790     22803  ...      17850  United Kingdom
4542    536790     21730  ...      17850  United Kingdom
4543    536791     22632  ...      17850  United Kingdom
4544    536791     22633  ...      17850  United Kingdom

[297 rows x 8 columns]

In [ ]:
# SELECT * FROM retial WHERE CustomerID='17850' and UnitPrice > 5;
retail[(retail.CustomerID == '17850') & (retail.UnitPrice > 5)]

     InvoiceNo StockCode  ... CustomerID         Country
5       536365     22752  ...      17850  United Kingdom
58      536373     82486  ...      17850  United Kingdom
63      536373     22752  ...      17850  United Kingdom
75      536375     82486  ...      17850  United Kingdom
80      536375     22752  ...      17850  United Kingdom
288     536396     82486  ...      17850  United Kingdom
293     536396     22752  ...      17850  United Kingdom
294     536396     22803  ...      17850  United Kingdom
425     536406     82486  ...      17850  United Kingdom
430     536406     22752  ...      17850  United Kingdom
431     536406     22803  ...      17850  United Kingdom
3121    536600     82486  ...      17850  United Kingdom
3127    536600     22752  ...      17850  United Kingdom
3128    536600     22803  ...      17850  United Kingdom
3141    536602     22752  ...      17850  United Kingdom
3200    536609     82486  ...      17850  United Kingdom
3206    536609     22752  ...      17850  United Kingdom
3232    536612     82486  ...      17850  United Kingdom
3433    536628     82486  ...      17850  United Kingdom
3439    536628     22752  ...      17850  United Kingdom
3451    536630     82486  ...      17850  United Kingdom
3457    536630     22752  ...      17850  United Kingdom
3805    536685     22752  ...      17850  United Kingdom
3806    536685     22803  ...      17850  United Kingdom
3816    536685     82486  ...      17850  United Kingdom
3831    536690     82486  ...      17850  United Kingdom
3837    536690     22752  ...      17850  United Kingdom
3838    536690     22803  ...      17850  United Kingdom
4171    536750     82486  ...      17850  United Kingdom
4177    536750     22752  ...      17850  United Kingdom
4178    536750     22803  ...      17850  United Kingdom
4192    536752     82486  ...      17850  United Kingdom
4198    536752     22752  ...      17850  United Kingdom
4199    536752     22803  ...      17850  United Kingdom
4521    536787     22752  ...      17850  United Kingdom
4535    536790     82486  ...      17850  United Kingdom
4540    536790     22752  ...      17850  United Kingdom
4541    536790     22803  ...      17850  United Kingdom

[38 rows x 8 columns]

In [ ]:
# SELECT * FROM retail WHERE InvoiceNo is not null;
retail[retail.InvoiceNo.notnull()]

# SELECT CustomerID, count(*) FROM retial GROUP BY CustomerID;
retail.groupby('CustomerID').size()

retail['Revenue'] = retail.Quantity * retail.UnitPrice
retail.head(3)

# SELECT CustomerID, avg(Revenue), count(*) FROM retial GROUP BY CustomerID;
retail.groupby('CustomerID').aggregate({'Revenue': np.mean, 'CustomerID': np.size})

retail.groupby('CustomerID').aggregate({'Revenue': np.mean, 'CustomerID': np.size}). \
    rename(columns={'Revenue': 'RevenueAverage', 'CustomerID': 'CustomerIDCount'})


retail['InvoiceDateDay'] = retail.InvoiceDate.dt.day
retail.head(2)

# SELECT InvoiceDateDay, sum(Revenue) FROM retail GROUP BY InvoiceDateDay;
results = retail.groupby('InvoiceDateDay').aggregate({'Revenue': np.sum})
results

# SELECT * FROM retail ORDER BY Quantity DESC LIMIT 5;
retail.nlargest(n=5, columns='Quantity')

# SELECT * FROM retail ORDER BY Quantity LIMIT 5;
retail.nsmallest(n=5, columns='Quantity')

                 Revenue  CustomerID
CustomerID
12346       77183.600000           1
12347          23.681319         182
12348          57.975484          31
12349          24.076027          73
12350          19.670588          17
...                  ...         ...
18280          18.060000          10
18281          11.545714           7
18282          14.837500          12
18283           2.771005         756
18287          26.246857          70

[4339 rows x 2 columns]